opcao = 0

while opcao != 9:
    print("""

░█████╗░░█████╗░██╗░░░░░░█████╗░██╗░░░██╗██╗░░░░░░█████╗░██████╗░░█████╗░██████╗░░█████╗░
██╔══██╗██╔══██╗██║░░░░░██╔══██╗██║░░░██║██║░░░░░██╔══██╗██╔══██╗██╔══██╗██╔══██╗██╔══██╗
██║░░╚═╝███████║██║░░░░░██║░░╚═╝██║░░░██║██║░░░░░███████║██║░░██║██║░░██║██████╔╝███████║
██║░░██╗██╔══██║██║░░░░░██║░░██╗██║░░░██║██║░░░░░██╔══██║██║░░██║██║░░██║██╔══██╗██╔══██║
╚█████╔╝██║░░██║███████╗╚█████╔╝╚██████╔╝███████╗██║░░██║██████╔╝╚█████╔╝██║░░██║██║░░██║
░╚════╝░╚═╝░░╚═╝╚══════╝░╚════╝░░╚═════╝░╚══════╝╚═╝░░╚═╝╚═════╝░░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝

██████╗░██╗░░░██╗████████╗██╗░░██╗░█████╗░███╗░░██╗  ███████╗░█████╗░████████╗███████╗░█████╗░
██╔══██╗╚██╗░██╔╝╚══██╔══╝██║░░██║██╔══██╗████╗░██║  ██╔════╝██╔══██╗╚══██╔══╝██╔════╝██╔══██╗
██████╔╝░╚████╔╝░░░░██║░░░███████║██║░░██║██╔██╗██║  █████╗░░███████║░░░██║░░░█████╗░░██║░░╚═╝
██╔═══╝░░░╚██╔╝░░░░░██║░░░██╔══██║██║░░██║██║╚████║  ██╔══╝░░██╔══██║░░░██║░░░██╔══╝░░██║░░██╗
██║░░░░░░░░██║░░░░░░██║░░░██║░░██║╚█████╔╝██║░╚███║  ██║░░░░░██║░░██║░░░██║░░░███████╗╚█████╔╝
╚═╝░░░░░░░░╚═╝░░░░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚═╝░░╚══╝  ╚═╝░░░░░╚═╝░░╚═╝░░░╚═╝░░░╚══════╝░╚════╝░
    """)

    print("OLÁ BEM VINDO AO MENU PRINCIPAL\n")

    print("1 - Soma (+)")
    print("2 - Subtração (-)")
    print("3 - Multiplicação (*)")
    print("4 - Divisão (/)")
    print("9 - Finalizar/Sair \n")

    opcao = int(input("Informe a opção desejada! "))

    if opcao == 9:
        break
    elif opcao in [1, 2, 3, 4]:
        num1 = float(input("Digite o primeiro número: "))
        num2 = float(input("Digite o segundo número: "))
        if opcao == 1:
            resultado = num1 + num2
            print("Resultado da soma:", resultado)
        elif opcao == 2:
            resultado = num1 - num2
            print("Resultado da subtração:", resultado)
        elif opcao == 3:
            resultado = num1 * num2
            print("Resultado da multiplicação:", resultado)
        elif opcao == 4:
            if num2 != 0:
                resultado = num1 / num2
                print("Resultado da divisão:", resultado)
            else:
                print("Erro: Divisão por zero!")
    else:
        print("Opção inválida! Por favor, escolha uma opção válida.")
